Revit 2026 API

# CurveIntersectResult Properties

---

The CurveIntersectResult type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Result | The classification of intersection or overlap between the two curves. |

#### Reference

CurveIntersectResult Class

Autodesk.Revit.DB Namespace